# Ultralytics YOLOv8n classification model configuration
# for ImageNet classification

# Number of classes (you should overwrite this when training)
nc: 15

# YOLOv8n backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 3, 2]],     # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],    # 1-P2/4
   [-1, 3, C2f, [128, True]],     # 2
   [-1, 1, Conv, [256, 3, 2]],    # 3-P3/8
   [-1, 6, C2f, [256, True]],     # 4
   [-1, 1, Conv, [512, 3, 2]],    # 5-P4/16
   [-1, 6, C2f, [512, True]],     # 6
   [-1, 1, Conv, [1024, 3, 2]],   # 7-P5/32
   [-1, 3, C2f, [1024, True]],    # 8
   [-1, 1, SPPF, [1024, 5]],      # 9
  ]

# YOLOv8 head
head:
  [[-1, 1, Classify, [nc]]]