#  modify ： Apr5 15:00

nc: 15

backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 3, C2f, [128]]
  - [-1, 1, SE_CBAM, [128]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 6, C2f, [256]]
  - [-1, 1, SE_CBAM, [256]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 6, C2f, [512]]
  - [-1, 1, SE_CBAM, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 3, C2f, [1024]]
  - [-1, 1, SE_CBAM, [1024]]

head:
  - [-1, 1, SPPF, [1024]]
  - [-1, 1, Classify, [nc]]
