# yolov8n-c3-cls.yaml
# Ultralytics-style YOLOv8 classification config with YOLOv5 backbone (C3 instead of C2f)
# For classification task

# Parameters
nc: 15  # number of classes, will be overridden by train set

# YOLOv5-like backbone with C3 instead of C2f
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 3, 2]]        # P1/2
  - [-1, 1, Conv, [128, 3, 2]]       # P2/4
  - [-1, 3, C3, [128]]
  - [-1, 1, Conv, [256, 3, 2]]       # P3/8
  - [-1, 6, C3, [256]]
  - [-1, 1, Conv, [512, 3, 2]]       # P4/16
  - [-1, 6, C3, [512]]
  - [-1, 1, Conv, [1024, 3, 2]]      # P5/32
  - [-1, 3, C3, [1024]]

# Classification head
head:
  - [-1, 1, SPPF, [1024]]
  - [-1, 1, Classify, [nc]]