# Ultralytics YOLOv8l classification model configuration
# for ImageNet classification

# Number of classes (you should overwrite this when training)
nc: 15

# YOLOv8l backbone
backbone:
  [[-1, 1, Conv, [192, 3, 2]],     # 0-P1/2
   [-1, 1, Conv, [384, 3, 2]],     # 1-P2/4
   [-1, 3, C2f, [384, True]],      # 2
   [-1, 1, Conv, [576, 3, 2]],     # 3-P3/8
   [-1, 6, C2f, [576, True]],      # 4
   [-1, 1, Conv, [768, 3, 2]],     # 5-P4/16
   [-1, 6, C2f, [768, True]],      # 6
   [-1, 1, Conv, [960, 3, 2]],     # 7-P5/32
   [-1, 3, C2f, [960, True]],      # 8
   [-1, 1, SPPF, [960, 5]],        # 9
  ]

# YOLOv8 head
head:
  [[-1, 1, Classify, [nc]]]